
## Plan Result (push-server-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/48833)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_service.application_ecs_service_ecs-service_A8BAB5F4 will be updated in-place
  ~ resource "aws_ecs_service" "application_ecs_service_ecs-service_A8BAB5F4" {
        id                                 = "arn:aws:ecs:us-east-1:996905175585:service/Push-Prod/Push-Prod"
        name                               = "Push-Prod"
        tags                               = {
            "environment" = "Prod"
            "service"     = "Push"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:996905175585:task-definition/Push-Prod:6" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/Push-Prod:6" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/Push-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/push-prod-app:884131da5f6a1e837c99bf21a8b6ccd9cccd7d95" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/push-prod-app:1a585b3a00451c83e1628f7e60ffe03b922eb062"
                    name                   = "app"
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "Push-Prod" -> (known after apply)
      ~ revision                 = 6 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "Push"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"6da9a1fd-8406-4a12-ab08-a094c2576484","JobName":"push-server_infrastructure_plan_prod","PRNumber":171,"Program":"tfcmt","SHA1":"1a585b3a00451c83e1628f7e60ffe03b922eb062","Target":"push-server-cdk","Vars":{}} -->